const booksDetailed = [
  {
    id: 11,
    title: '101 способ раскрутки личного бренда. Как сделать себе имя',
    rating: 1.67,
    issueYear: '2019',
    description: '101 способ раскрутки личного бренда. Как сделать себе имя',
    publish: 'Альпина Паблишер',
    pages: '355',
    cover: 'Мягкая обложка',
    weight: '230',
    format: '70x100/32',
    ISBN: '978-5-6042879-5-8',
    producer: 'ООО "ИПК Парето-Принт"',
    authors: ['Вячеслав Семенчук'],
    images: [
      {
        url: '/uploads/10859003_0_134ef8a55d.jpg',
      },
      {
        url: '/uploads/10859003_01_bdcbbc1bbc.jpg',
      },
      {
        url: '/uploads/10859003_1_40422e2d96.jpg',
      },
      {
        url: '/uploads/10859003_2_b26a8a8c92.jpg',
      },
      {
        url: '/uploads/10859003_3_55bcc10aa1.jpg',
      },
    ],
    categories: ['Бизнес'],
    comments: [
      {
        id: 9,
        rating: 1,
        text: '123',
        createdAt: '2023-01-22T13:13:11.484Z',
        user: {
          commentUserId: 14,
          firstName: 'qwerty',
          lastName: 'qwerty',
          avatarUrl: null,
        },
      },
      {
        id: 14,
        rating: 1,
        text: '11111',
        createdAt: '2023-01-22T14:00:14.536Z',
        user: {
          commentUserId: 14,
          firstName: 'qwerty',
          lastName: 'qwerty',
          avatarUrl: null,
        },
      },
      {
        id: 19,
        rating: 3,
        text: '',
        createdAt: '2023-02-05T18:25:02.712Z',
        user: {
          commentUserId: 14,
          firstName: 'qwerty',
          lastName: 'qwerty',
          avatarUrl: null,
        },
      },
    ],
    booking: null,
    delivery: null,
    histories: [
      {
        id: 7,
        userId: 4,
      },
      {
        id: 59,
        userId: 11,
      },
    ],
  },
  {
    id: 2,
    title: 'Построение бизнес-моделей: Настольная книга стратега и новатора',
    rating: 3,
    issueYear: '2019',
    description:
      'Книга предлагает оригинальную концепцию анализа, построения и совершенствования бизнес-моделей, которой пользуются крупнейшие компании мира, включая Google, IBM, Ericsson. Авторы предлагают простой и понятный способ визуального представления основных факторов, влияющих на успех любой организации: потребительские сегменты, ценностные предложения, каналы сбыта, взаимоотношения с клиентами, потоки поступления доходов, ключевые ресурсы, ключевые виды деятельности, ключевые партнеры, структура издержек. Большой лист бумаги и блок стикеров — вот и все, что понадобится для освоения авторского метода создания бизнес-моделей. А еще креативность, острый ум и упорство членов команды, работающей над проектом.\nКнига адресована предпринимателям и руководителям, которые хотели бы создать новую или реорганизовать имеющуюся модель бизнеса.',
    publish: 'Алпина Паблишер',
    pages: '288',
    cover: 'Мягкая обложка',
    weight: '685',
    format: '60x90/8',
    ISBN: '978-0470-87641-1',
    producer: 'АО «Первая образцовая типография» ',
    authors: ['Александр Остервальдер'],
    images: [
      {
        url: '/uploads/10209755_0_Postroenie_biznes_modeley_Nastolnaya_kniga_stratega_i_novatora_Aleksandr_Ostervalder_Iv_Pine_931aabe20f.jpg',
      },
    ],
    categories: ['Бизнес'],
    comments: [
      {
        id: 18,
        rating: 3,
        text: '53',
        createdAt: '2023-01-26T18:28:10.039Z',
        user: {
          commentUserId: 14,
          firstName: 'qwerty',
          lastName: 'qwerty',
          avatarUrl: null,
        },
      },
    ],
    booking: null,
    delivery: null,
    histories: null,
  },
  {
    id: 3,
    title: 'Разработка ценностных предложений: Как создавать товары и услуги, которые захотят купить потребители',
    rating: null,
    issueYear: '2018',
    description:
      'В основе любой бизнес-модели лежит ценностное предложение, описывающее преимущества, которые ваши товары и услуги дают потребителю.\n\nНовый инструмент, разработанный авторами этой книги, - шаблон ценностного предложения, позволит рассмотреть все аспекты сложного процесса разработки и тестирования новых продуктов и прийти к такому варианту предложения, который выведет ваш бизнес в лидеры рынка. В книге приводится огромное число примеров разработки и анализа ценностных предложений от лучших мировых компаний, что делает ее предельно практичным инструментом для бизнеса из любой сферы.',
    publish: 'Алпина Паблишер',
    pages: '312',
    cover: 'Мягкая обложка',
    weight: '650',
    format: '60x90/8',
    ISBN: '978-1-118-96805-5',
    producer: 'АО «Первая образцовая типография» ',
    authors: ['Александр Остервальдер'],
    images: [
      {
        url: '/uploads/10442229_0_5d1c5827e4.jpg',
      },
    ],
    categories: ['Бизнес'],
    comments: null,
    booking: {
      id: 130,
      order: true,
      dateOrder: '2023-01-24T13:31:42.192Z',
      customerId: 5,
      customerFirstName: 'Дарья',
      customerLastName: 'Бичан',
    },
    delivery: null,
    histories: [
      {
        id: 60,
        userId: 5,
      },
    ],
  },
  {
    id: 4,
    title: 'Хулиномика 3.0: хулиганская экономика. Еще толще. Еще длиннее',
    rating: null,
    issueYear: '2019',
    description:
      'Экономика - это очень скучно. Куча непонятны заумных слов и формул? Кто вам такое сказал? Экономика это интересно и просто! ',
    publish: 'Издательство Аст',
    pages: '480',
    cover: 'Твердый переплет',
    weight: '150',
    format: '84x108/32',
    ISBN: '978-5-17-113704-5',
    producer: 'ООО "Издательство АСТ"',
    authors: ['Алексей Марков'],
    images: [
      {
        url: '/uploads/10849349_0_89b742cffa.jpg',
      },
    ],
    categories: ['Бизнес'],
    comments: null,
    booking: null,
    delivery: null,
    histories: [
      {
        id: 40,
        userId: 6,
      },
    ],
  },
  {
    id: 7,
    title: 'Мастер времени',
    rating: null,
    issueYear: '2018',
    description:
      'Хотите узнать, как извлечь максимум пользы из своего времени? Эффективный тайм-менеджмент, без преувеличения, может изменить всю вашу жизнь. Эксперт в вопросах производительности Брайан Трейси подробно объяснит читателям, что нужно делать, чтобы быстрее достигать большего, затрачивая гораздо меньше усилий!\nОн предлагает простые шаги, позволяющие выбирать идеальный момент для решения каждой конкретной задачи.',
    publish: 'ПОПУРРИ',
    pages: '144',
    cover: 'Интегральная обложка (полумягкая)',
    weight: '170',
    format: '60х84/16',
    ISBN: '978-9-8515-3523-7',
    producer: 'ООО "Попурри"',
    authors: ['Брайан Трейси'],
    images: [
      {
        url: '/uploads/10689720_0_Master_vremeni_Brayan_Treysi_e841bace3e.jpg',
      },
    ],
    categories: ['Бизнес'],
    comments: null,
    booking: null,
    delivery: null,
    histories: null,
  },
  {
    id: 9,
    title: 'Продажник на всю голову: Крутые стратегии профессионала',
    rating: null,
    issueYear: '2020',
    description:
      'Владимир Якуба - бизнес-тренер и Продажник с большой буквы. Он любит повторять, что провёл обучение в 112 городах, 17 странах, а также является автором 8 книг, 11 обучающих фильмов, более 300 публикаций в 42 изданиях. И после переспрашивает: запомнили, сколько было стран? И его слушатели запоминают. \r\nТак действуют и методы Владимира Якубы - простые, понятные, много раз отработанные на практике. Владимир учит продавать на любом уровне и на любых площадках: гендиректору и рядовому менеджеру, по телефону и «в полях». В своей новой книге Владимир собрал самые крутые стратегии: освойте их - и вам открыта дорога в клуб профессионалов, «продажников на всю голову»!\r\n',
    publish: 'Издательство АСТ',
    pages: '288',
    cover: 'Твердый переплет',
    weight: '385',
    format: '70x90/16',
    ISBN: '978-5-17-111194-6',
    producer: 'Филиал ООО "УК" "ИРМА" "Тульская типография"',
    authors: ['Владимир Якуба'],
    images: [
      {
        url: '/uploads/10782569_0_3cdfa87016.jpg',
      },
    ],
    categories: ['Бизнес'],
    comments: null,
    booking: null,
    delivery: null,
    histories: null,
  },
  {
    id: 1,
    title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
    rating: 4.3,
    issueYear: '2019',
    description:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время?\nОткройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    publish: 'Питер',
    pages: '288',
    cover: 'Мягкая обложка',
    weight: '370',
    format: '70х100',
    ISBN: '978-5-4461-0923-4',
    producer: 'ООО «Питер Мейл». РФ, 198 206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
    authors: ['Адитья Бхаргава'],
    images: [
      {
        url: '/uploads/image_book_5e25f0be0d.jpg',
      },
    ],
    categories: ['Зарубежная литература', 'Компьютерная литература'],
    comments: [
      {
        id: 1,
        rating: 4,
        text: 'Самая лучшая книга в мире',
        createdAt: '2022-10-23T12:23:13.012Z',
        user: {
          commentUserId: 6,
          firstName: 'Aliaksei',
          lastName: 'Valadzko',
          avatarUrl: '/uploads/thumbnail_Screenshot_3_1016a62c87.png',
        },
      },
    ],
    booking: {
      id: 7,
      order: true,
      dateOrder: '2022-10-24T00:00:00.000Z',
      customerId: 6,
      customerFirstName: 'Алексей',
      customerLastName: 'Володько',
    },
    delivery: {
      id: 7,
      handed: true,
      dateHandedFrom: '2022-10-24T00:00:00.000Z',
      dateHandedTo: '2022-10-28T00:00:00.000Z',
      recipientId: 6,
      recipientFirstName: 'Ал',
      recipientLastName: 'Вал',
    },
    histories: [
      {
        id: 1,
        userId: 7,
      },
    ],
  },
];

const DETAILED_BOOK_MOCK = booksDetailed.at(-1);

export { DETAILED_BOOK_MOCK };
